ERP DEV.WMS/src/Catalogs/вмс_РаспоряженияОпераций/вмс_РаспоряженияОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_РаспоряженияОпераций</name>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РаспоряжениеКонфигуратор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСКДТовары</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСКДДокументы</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОперацияДляПросмотраРезультата</name>
    <type>
      <types>CatalogRef.вмс_Операции</types>
    </type>
  </attributes>
</mdclass:Catalog>

ERP DEV.WMS/src/Catalogs/вмс_Операции/вмс_Операции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_Операции</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ДанныеСКД</name>
    <type>
      <types>CatalogRef.вмс_ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеКладовщикуРаспоряжение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрашиватьУслугиХранения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяДляПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФормы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлассОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлассОперацииХранилище</name>
    <type>
      <types>CatalogRef.вмс_ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>НачальнаяФорма</name>
    <type>
      <types>CatalogRef.вмс_ИнтерфейсыТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкаВФормеСписка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоРаспоряжению</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поток</name>
    <type>
      <types>EnumRef.вмс_СкладскиеПотоки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредопределенныеДанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазбиватьПоПомещениям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСКДДокументы</name>
    <type>
      <types>CatalogRef.вмс_ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСКДЗаданияКладовщику</name>
    <type>
      <types>CatalogRef.вмс_ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСхемыКомпоновкиДанных</name>
    <type>
      <types>CatalogRef.вмс_ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоИнвентаризация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДанныеСКД</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКлассОперацииХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьХранилищеСКДДокументы</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьХранилищеСКДЗаданияКладовщику</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьХранилищеСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Распоряжения</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаНаРаспоряжение</name>
      <type>
        <types>CatalogRef.вмс_РаспоряженияОпераций</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыОперации</name>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.вмс_ЭтапыОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>CatalogRef.вмс_СтатусыДокументов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвойстваОперации</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.вмс_СвойстваОпераций</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтветственноеХранение</name>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.вмс_УслугиОтветственногоХранения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.вмс_ДополнительныеРеквизиты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.вмс_ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПочтовыеРассылки</name>
    <attributes>
      <name>Рассылка</name>
      <type>
        <types>CatalogRef.вмс_ПочтовыеРассылки</types>
      </type>
    </attributes>
    <attributes>
      <name>Активная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Алгоритмы</name>
    <attributes>
      <name>Алгоритм</name>
      <type>
        <types>CatalogRef.вмс_Алгоритмы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриСохранении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриЗавершении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПравилоКонвертации</name>
      <type>
        <types>CatalogRef.вмс_ПравилаКонвертацииРеквизитов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбработкиПередЗавершением</name>
    <attributes>
      <name>Использование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Обработка</name>
      <type>
        <types>CatalogRef.вмс_ИнтерфейсыТСД</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОперацииПлана</name>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.вмс_Операции</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыОперации</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НаФронтенде</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НаБэкенде</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФормыОперации</name>
    <attributes>
      <name>МакетФормы</name>
      <type>
        <types>CatalogRef.вмс_ИнтерфейсыТСД</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МетодыОперации</name>
    <attributes>
      <name>ИмяМетода</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Данные</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НормыKPI</name>
    <attributes>
      <name>КоличествоМинут</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЕдиниц</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>EnumRef.вмс_ЕдиницыИзмеренияKPI</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP DEV.WMS/src/Catalogs/вмс_НастройкиОператора/вмс_НастройкиОператора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_НастройкиОператора</name>
  <attributes>
    <name>Оператор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиФорм</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаОтветственногоХранения</name>
    <type>
      <types>CatalogRef.вмс_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДоступа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьКоличествоРаспоряжений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьРучнойВвод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Разработчик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗвуковаяСхема</name>
    <type>
      <types>CatalogRef.вмс_Звуки</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьПрисвоениеШтрихкода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МасштабФормы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Операции</name>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.вмс_Операции</types>
      </type>
    </attributes>
    <attributes>
      <name>МастерОперация</name>
      <type>
        <types>CatalogRef.вмс_Операции</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Принтеры</name>
    <attributes>
      <name>ТипПринтера</name>
      <type>
        <types>EnumRef.ТипыПринтеров</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоУмолчанию</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяКомпьютера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПутьКПринтеру</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Принтер</name>
      <type>
        <types>CatalogRef.вмс_Принтеры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Склады</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ячейки</name>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.вмс_МестаХранения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Помещения</name>
    <attributes>
      <name>Помещение</name>
      <type>
        <types>CatalogRef.вмс_Помещения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP DEV.WMS/src/Catalogs/вмс_РаспоряженияОпераций/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

Функция ПолучитьСписокТоваровПоРаспоряжениям(ВходящиеПараметры, ВыводВТабличныйДокумент = Ложь) Экспорт   
	//ТУ_Кошелев 10.06.24 - Новая схема просмотра результатов СКД товаров в учетке
	Если ВыводВТабличныйДокумент Тогда
		РезультатТабДок = Новый ТабличныйДокумент;     
		ТипКомпоновщикаМакета = Тип("ГенераторМакетаКомпоновкиДанных");
	Иначе   
		ТипКомпоновщикаМакета = Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений");
	КонецЕсли; 
	//
	
	ВидОперации = Неопределено;
	ИмяДляПоиска = Неопределено;
	Если ТипЗнч(ВходящиеПараметры) = Тип("Структура") Тогда
		Распоряжения = ВходящиеПараметры.ПараметрДокументы;
		ВходящиеПараметры.Свойство("ВидОперации", ВидОперации);
		Если ВидОперации <> Неопределено Тогда
			ИмяДляПоиска = ВидОперации.ИмяДляПоиска;
		КонецЕсли;
	Иначе
		Распоряжения = ВходящиеПараметры;
	КонецЕсли;
		
	МассивРаспоряжений = вмс_РаботаСКоллекциями.ЗначениеВМассив(Распоряжения);
	ТаблицаРаспоряжений = вмс_РаботаСКоллекциями.НоваяТаблицаЗначений("Распоряжение, Тип");
	Для Каждого Распоряжение Из МассивРаспоряжений Цикл
		СтрокаРаспоряжения = ТаблицаРаспоряжений.Добавить();
		СтрокаРаспоряжения.Распоряжение = Распоряжение;
		СтрокаРаспоряжения.Тип = вмс_ОбщегоНазначенияВызовСервера.ПолучитьИмяТипаОбъекта(Распоряжение);
	КонецЦикла;
	
	ТаблицаТиповРаспоряжений = ТаблицаРаспоряжений.Скопировать();
	ТаблицаТиповРаспоряжений.Свернуть("Тип");
	
	ТаблицаТоваров = Новый ТаблицаЗначений;
	ТаблицаТоваров.Колонки.Добавить("Ссылка");
	
	Для Каждого СтрокаТипаРаспоряжений Из ТаблицаТиповРаспоряжений Цикл
		ТипРаспоряжения = СтрокаТипаРаспоряжений.Тип;
		СсылкаНаОписаниеТипаРаспоряжения = НайтиТипРаспоряженияДляДокумента(ТипРаспоряжения, ВидОперации); //ТУ_Кошелев_07.06.24 - изменения в связи с новой системой формирования запросов СКД распоряжений операций
		//ТУ_КС+
		Если СсылкаНаОписаниеТипаРаспоряжения = Неопределено Тогда
			Если ВидОперации.Распоряжения.Количество()=1 Тогда
				СсылкаНаОписаниеТипаРаспоряжения = ВидОперации.Распоряжения[0].СсылкаНаРаспоряжение;
			КонецЕсли;
		КонецЕсли;
		//ТУ_КС-
		
		Если СсылкаНаОписаниеТипаРаспоряжения = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		ОписаниеТипаРаспоряжения = СсылкаНаОписаниеТипаРаспоряжения.ПолучитьОбъект();
		ОписаниеТипаРаспоряжения.Прочитать();
		СхемаКомпоновкиДанных = ОписаниеТипаРаспоряжения.ХранилищеСКДТовары.Получить();
		Если СхемаКомпоновкиДанных = Неопределено Тогда
			Продолжить;
		КонецЕсли;   
		
		СтрокиРаспоряженийПоТипу = ТаблицаРаспоряжений.НайтиСтроки(Новый Структура("Тип", ТипРаспоряжения));
		МассивРаспоряженийПоТипу = вмс_РаботаСКоллекциями.ВыгрузитьЗначенияКолонокКоллекции(СтрокиРаспоряженийПоТипу, "Распоряжение");
		СписокЗначенийРаспоряженийПоТипу = Новый СписокЗначений;
		СписокЗначенийРаспоряженийПоТипу.ЗагрузитьЗначения(МассивРаспоряженийПоТипу);

		КомпоновщикНастроекКомпоновкиДанных = Новый КомпоновщикНастроекКомпоновкиДанных;
		КомпоновщикНастроекКомпоновкиДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
		КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(СхемаКомпоновкиДанных.ВариантыНастроек.Основной.Настройки);
		НастройкиКомпоновки = КомпоновщикНастроекКомпоновкиДанных.ПолучитьНастройки();
		
		ВсеДоступныеПоля = вмс_РаботаСКоллекциями.ВыгрузитьЗначенияКолонокКоллекции(НастройкиКомпоновки.Выбор.ДоступныеПоляВыбора.Элементы, "Имя");
		РаботаССКД.ВключитьПоляВыбораНастроекСКД(НастройкиКомпоновки, ВсеДоступныеПоля);
		РаботаССКД.УстановитьНастройкиДляПолученияКоллекцииЗначений(НастройкиКомпоновки);
		РаботаССКД.ДобавитьОтбор(НастройкиКомпоновки.Отбор.Элементы, "Ссылка", СписокЗначенийРаспоряженийПоТипу, ВидСравненияКомпоновкиДанных.ВСписке); 
		                                                           
		//установка операции параметром 
		ПараметрСКДОперация = НастройкиКомпоновки.ПараметрыДанных.Элементы.Найти("Операция");
		Если ПараметрСКДОперация <> Неопределено Тогда
			ПараметрСКДОперация.Значение = ВидОперации;
			ПараметрСКДОперация.Использование = Истина;	
		КонецЕсли;
		//установка операции параметром	
		
		//установка операции параметром (по имени операции)
		ПараметрСКДОперацияИмя = НастройкиКомпоновки.ПараметрыДанных.Элементы.Найти("ОперацияИмяДляПоиска");
		Если ПараметрСКДОперацияИмя <> Неопределено Тогда
			ПараметрСКДОперацияИмя.Значение = ИмяДляПоиска;
			ПараметрСКДОперацияИмя.Использование = Истина;	
		КонецЕсли;
		//установка операции параметром
		
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновки, , , ТипКомпоновщикаМакета); 
		
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
		
		//ТУ_Кошелев 10.06.24 - Новая схема просмотра результатов СКД товаров в учетке
		//При просмотре результатов, обработка данных заканчивается здесь, если будут изменения в логике после этого момента, может привести к расхождениям результатов на ТСД и в учетке при просмотре.
		Если ВыводВТабличныйДокумент Тогда					
			ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
			ПроцессорВывода.УстановитьДокумент(РезультатТабДок);
			ПроцессорВывода.Вывести(ПроцессорКомпоновки);   
		Иначе              
			ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
			ТаблицаТоваровПоТипуРаспоряжений = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
			
			вмс_РаботаСКоллекциями.ДополнитьКолонкиТаблицыЗначений(ТаблицаТоваров, , ТаблицаТоваровПоТипуРаспоряжений);
			вмс_РаботаСКоллекциями.ДобавитьЭлементыКоллекции(ТаблицаТоваров, ТаблицаТоваровПоТипуРаспоряжений);
		КонецЕсли;
		//
	КонецЦикла;
	
	//ТУ_Кошелев 10.06.24 - Новая схема просмотра результатов СКД товаров в учетке
	Если ВыводВТабличныйДокумент Тогда  
		Возврат РезультатТабДок;
	КонецЕсли;   
	//
	
	//ТУ_КС+
	ДополнитьТаблицуТоваровТоварнымиПолями(ТаблицаТоваров);
	//ТУ_КС-
	
	НастройкиКолонок = Новый ТаблицаЗначений;
	НастройкиКолонок.Колонки.Добавить("Имя");
	НастройкиКолонок.Колонки.Добавить("Заголовок");
	НастройкиКолонок.Колонки.Добавить("Ширина");
	
	ДанныеСпискаТоваров = Новый Структура;
	ДанныеСпискаТоваров.Вставить("НастройкиКолонок", НастройкиКолонок);
	ДанныеСпискаТоваров.Вставить("УсловноеОформление", Неопределено);
	ДанныеСпискаТоваров.Вставить("Таблица", ТаблицаТоваров);
	
	Возврат ДанныеСпискаТоваров;

КонецФункции

Функция ДополнитьТаблицуТоваровТоварнымиПолями(ТаблицаТоваров)
	
	ТоварныеПоляМассив = вмс_ОперацииПоЯчейкамВызовСервера.ИспользуемыеТоварныеПоля();
	ТипыДанныхКонфигурации = вмс_АдаптацияКонфигураций.ПолучитьТипыДанныхКонфигурации();
	
	Для Каждого ТоварноеПоле Из ТоварныеПоляМассив Цикл
		
		Если ТаблицаТоваров.Колонки.Найти(ТоварноеПоле) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		МассивТиповПоля = Новый Массив;
		Если ТоварноеПоле="Серия" Тогда
			//наша серия
			МассивТиповПоля.Добавить(Тип("СправочникСсылка.вмс_СерииНоменклатуры"));
		Иначе
			НайденныеТипыПоля = ТипыДанныхКонфигурации.НайтиСтроки(Новый Структура("Наименование", ТоварноеПоле));
			Для Каждого НайденныйТипПоля Из НайденныеТипыПоля Цикл
				ИмяТипаОбъектаИБ = НайденныйТипПоля.ТипДанных;
				Если Метаданные.НайтиПоПолномуИмени(ИмяТипаОбъектаИБ) = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				ИмяТипаСсылкиОбъектаИБ = вмс_ОбщегоНазначенияВызовСервера.ПолучитьИмяТипаСсылкиОбъектаИБ(ИмяТипаОбъектаИБ);
				ТипПоля = Тип(ИмяТипаСсылкиОбъектаИБ);
				МассивТиповПоля.Добавить(ТипПоля);
			КонецЦикла;
		КонецЕсли;
		
		ОписаниеТиповПоля = Новый ОписаниеТипов(МассивТиповПоля);
		
		ТаблицаТоваров.Колонки.Добавить(ТоварноеПоле, ОписаниеТиповПоля);
		
	КонецЦикла;
	
КонецФункции

Функция НайтиТипРаспоряженияДляДокумента(Документ, ВидОперации) Экспорт
	Если ТипЗнч(Документ) = Тип("Строка") Тогда
		ИмяДокумента = Документ;
	Иначе
		ИмяДокумента = вмс_ОбщегоНазначенияВызовСервера.ПолучитьИмяТипаОбъекта(Документ);
	КонецЕсли;
	
	Если ИмяДокумента <> Неопределено Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Имя", ИмяДокумента);
		Запрос.УстановитьПараметр("ВидОперации", ВидОперации);
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	вмс_ОперацииРаспоряжения.СсылкаНаРаспоряжение КАК Ссылка
		|ИЗ
		|	Справочник.вмс_Операции.Распоряжения КАК вмс_ОперацииРаспоряжения
		|ГДЕ
		|	вмс_ОперацииРаспоряжения.Ссылка = &ВидОперации
		|	И вмс_ОперацииРаспоряжения.СсылкаНаРаспоряжение.РаспоряжениеКонфигуратор = &Имя";

		РезультатЗапроса = Запрос.Выполнить();
		ТаблицаЗапроса = РезультатЗапроса.Выгрузить();
		ТипыРаспоряжений = ТаблицаЗапроса.ВыгрузитьКолонку("Ссылка");
	Иначе
		ТипыРаспоряжений = Новый Массив;
	КонецЕсли;
	
	Если ТипыРаспоряжений.Количество() = 1 Тогда
		//исключить дублирование
		Возврат ТипыРаспоряжений[0];
	КонецЕсли;	
КонецФункции

Функция УстановитьРабочиеСтатусыВНастройкахСКДСпискаДокументов(Операция, СхемаКомпоновкиДанных) Экспорт
	НастройкиСКД = СхемаКомпоновкиДанных.ВариантыНастроек[0].Настройки;
	ПредставлениеОтбора = "Отбор по рабочим статусам";
	ОтборПоРабочимСтатусам = вмс_РаботаСКоллекциями.НайтиЭлементКоллекции(НастройкиСКД.Отбор.Элементы, Новый Структура("Представление", ПредставлениеОтбора));
	Если ОтборПоРабочимСтатусам = Неопределено Тогда
		ОтборПоРабочимСтатусам = НастройкиСКД.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборПоРабочимСтатусам.Представление = ПредставлениеОтбора;
	КонецЕсли; 
	
	СписокРабочихСтатусов = Новый СписокЗначений;      
	
	ЭтапКОбработке = Справочники.вмс_ЭтапыОперации.НайтиПоРеквизиту("Имя", "КОбработке");
	
	СтрокиРабочихСтатусов = Операция.ЭтапыОперации.НайтиСтроки(Новый Структура("Этап", ЭтапКОбработке));
	МассивРабочихСтатусовКОбработке = вмс_РаботаСКоллекциями.ВыгрузитьЗначенияКолонкиКоллекции(СтрокиРабочихСтатусов, "Статус");
	
	
	ЭтапВРаботе = Справочники.вмс_ЭтапыОперации.НайтиПоРеквизиту("Имя", "ВРаботе");
	
	СтрокиРабочихСтатусов = Операция.ЭтапыОперации.НайтиСтроки(Новый Структура("Этап", ЭтапВРаботе));
	МассивРабочихСтатусовВРаботе = вмс_РаботаСКоллекциями.ВыгрузитьЗначенияКолонкиКоллекции(СтрокиРабочихСтатусов, "Статус");
	
	МассивРабочихСтатусов = вмс_РаботаСКоллекциями.СложениеМассивов(МассивРабочихСтатусовКОбработке,МассивРабочихСтатусовВРаботе);
	СписокРабочихСтатусов.ЗагрузитьЗначения(МассивРабочихСтатусов);
	
	ОтборПоРабочимСтатусам.Использование = Истина;
	ОтборПоРабочимСтатусам.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Статус");
	ОтборПоРабочимСтатусам.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборПоРабочимСтатусам.ПравоеЗначение = СписокРабочихСтатусов;
КонецФункции     

Функция УстановитьОтборПоСкладам(Склады, НастройкиСКД) Экспорт
	ПредставлениеОтбора = "Отбор по складам";
	ОтборПоСкладам = вмс_РаботаСКоллекциями.НайтиЭлементКоллекции(НастройкиСКД.Отбор.Элементы, Новый Структура("Представление", ПредставлениеОтбора));
	Если ОтборПоСкладам = Неопределено Тогда
		ОтборПоСкладам = НастройкиСКД.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборПоСкладам.Представление = ПредставлениеОтбора;
	КонецЕсли; 
	
	СписокСкладов = Новый СписокЗначений;
	СписокСкладов.ЗагрузитьЗначения(Склады);
	
	ОтборПоСкладам.Использование = Истина;
	ОтборПоСкладам.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Склад");
	ОтборПоСкладам.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборПоСкладам.ПравоеЗначение = СписокСкладов;
КонецФункции

Функция ПолучитьДанныеПоРаспоряжению(Операция, Распоряжение, ВходящиеПараметры, ВыводВТабличныйДокумент = Ложь) Экспорт
	//ТУ_Кошелев 10.06.24 - Новая схема просмотра результатов СКД документов в учетке
	Если ВыводВТабличныйДокумент Тогда
		РезультатТабДок = Новый ТабличныйДокумент;
		ТипКомпоновщикаМакета = Тип("ГенераторМакетаКомпоновкиДанных");
	Иначе
		Результат = Неопределено;
		ТипКомпоновщикаМакета = Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений");
	КонецЕсли;
	//
	
	Попытка
		СхемаКомпоновкиДанных = Распоряжение.ХранилищеСКДДокументы.Получить();
		
		Если СхемаКомпоновкиДанных <> Неопределено Тогда
			УстановитьРабочиеСтатусыВНастройкахСКДСпискаДокументов(Операция, СхемаКомпоновкиДанных);
			
			КомпоновщикНастроекКомпоновкиДанных = Новый КомпоновщикНастроекКомпоновкиДанных;
			КомпоновщикНастроекКомпоновкиДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
			КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(СхемаКомпоновкиДанных.ВариантыНастроек.Основной.Настройки);
			НастройкиКомпоновки = КомпоновщикНастроекКомпоновкиДанных.ПолучитьНастройки();
			
			ПоляКомпоновкиОтборов = вмс_РаботаСКоллекциями.СтрокуВМассив("Ссылка, Номер, Дата");
			ЭлементыОтборов = вмс_РаботаСКоллекциями.ВыгрузитьЗначенияКолонокКоллекции(НастройкиКомпоновки.УсловноеОформление.Элементы, "Отбор.Элементы");
			ЭлементыОтборов = вмс_РаботаСКоллекциями.ВыгрузитьЭлементыКоллекцииВМассив(ЭлементыОтборов, 1);
			ЭлементыОтборов = вмс_РаботаСКоллекциями.ПреобразоватьИерархическуюКоллекциюВПлоскую(ЭлементыОтборов, "Элементы");
			ЗначенияОтборов = вмс_РаботаСКоллекциями.ВыгрузитьЗначенияКолонокКоллекции(ЭлементыОтборов, "ЛевоеЗначение, ПравоеЗначение");
			Для Каждого ЗначениеОтбора Из ЗначенияОтборов Цикл
				Если ТипЗнч(ЗначениеОтбора) = Тип("ПолеКомпоновкиДанных") Тогда
					ИмяПоля = Строка(ЗначениеОтбора);
					Если ПоляКомпоновкиОтборов.Найти(ИмяПоля) = Неопределено Тогда
						ПоляКомпоновкиОтборов.Добавить(ИмяПоля);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			РаботаССКД.ВключитьПоляВыбораНастроекСКД(НастройкиКомпоновки, ПоляКомпоновкиОтборов);
			РаботаССКД.УстановитьНастройкиДляПолученияКоллекцииЗначений(НастройкиКомпоновки);  
			
			//Отбор по складам  
			Попытка
				Если ВходящиеПараметры.Свойство("Оператор") Тогда 	
					Склады = Справочники.вмс_НастройкиОператора.ПолучитьДоступныеСкладыОператора(ВходящиеПараметры.Оператор);
					Если ЗначениеЗаполнено(Склады) Тогда     
						УстановитьОтборПоСкладам(Склады, НастройкиКомпоновки);
					КонецЕсли; 	                                
				КонецЕсли;				
			Исключение
				ЗаписьЖурналаРегистрации("ТСД", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
			КонецПопытки;
			//Отбор по складам 
			
			//установка операции параметром 
			ПараметрСКДОперация = НастройкиКомпоновки.ПараметрыДанных.Элементы.Найти("Операция");
			Если ПараметрСКДОперация <> Неопределено Тогда
				ПараметрСКДОперация.Значение = Операция;
				ПараметрСКДОперация.Использование = Истина;	
			КонецЕсли;
			//установка операции параметром 
			
			//установка операции параметром (по имени операции)
			ПараметрСКДОперацияИмя = НастройкиКомпоновки.ПараметрыДанных.Элементы.Найти("ОперацияИмяДляПоиска");
			Если ПараметрСКДОперацияИмя <> Неопределено Тогда
				ПараметрСКДОперацияИмя.Значение = Операция.ИмяДляПоиска;
				ПараметрСКДОперацияИмя.Использование = Истина;	
			КонецЕсли;
			//установка операции параметром    
			
			//установить одноименные параметры скд
			Для Каждого ВходящийПараметр Из ВходящиеПараметры Цикл
				ПараметрСКД = НастройкиКомпоновки.ПараметрыДанных.Элементы.Найти(ВходящийПараметр.Ключ);
				Если ПараметрСКД <> Неопределено Тогда
					ПараметрСКД.Значение = ВходящийПараметр.Значение;
					ПараметрСКД.Использование = Истина;	
				КонецЕсли;
			КонецЦикла;

			КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
			МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновки,,, ТипКомпоновщикаМакета); 
			
			ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
			ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
			
			//ТУ_Кошелев 10.06.24 - Новая схема просмотра результатов СКД документов в учетке
			//При просмотре результатов, обработка данных заканчивается здесь, если будут изменения в логике после этого момента, может привести к расхождениям результатов на ТСД и в учетке при просмотре.
			Если ВыводВТабличныйДокумент Тогда					
				ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
				ПроцессорВывода.УстановитьДокумент(РезультатТабДок);
				ПроцессорВывода.Вывести(ПроцессорКомпоновки);   
			Иначе                                                                              
				ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
				Таблица = ПроцессорВывода.Вывести(ПроцессорКомпоновки); 
				
				Результат = Новый Структура;
				Результат.Вставить("Таблица", Таблица);
				Результат.Вставить("НастройкиКомпоновки", НастройкиКомпоновки);
			КонецЕсли;  
			//
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	//ТУ_Кошелев 10.06.24 - Новая схема просмотра результатов СКД документов в учетке
	Если ВыводВТабличныйДокумент Тогда     
		Возврат РезультатТабДок;
	Иначе
		Возврат Результат;     
	КонецЕсли;
	//
КонецФункции

#КонецЕсли
